jaxws-ri/tests/unit/testcases/mtom/issue_671/resources/raw.envelope

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><XDocIn xmlns="http://example.org/mtom"><doc1><Include xmlns="http://www.w3.org/2004/08/xop/include" href="cid:2c5bbb50-5679-4fea-9982-666753769e20@example.jaxws.sun.com"/></doc1></XDocIn></S:Body></S:Envelope>
<!--

    Copyright (c) 2018 Oracle and/or its affiliates. All rights reserved.

    This program and the accompanying materials are made available under the
    terms of the Eclipse Distribution License v. 1.0, which is available at
    http://www.eclipse.org/org/documents/edl-v10.php.

    SPDX-License-Identifier: BSD-3-Clause

-->


